# SQL

RDBMS: Relational database management system 


Case Insensative


Tabular data
* Creating a database
* creating a table
* insert data into table
* Read data from the table
* UPdate data in  the table
* Delete data tuple from the table
* filtering data using where clause

In [1]:
import sqlite3

In [2]:
con = sqlite3.connect('broadway.db')# broadway.db is database

# creating table in sql.

```sql
Create table table_name
(column_name_1 datatype , column_name_2 datatype, ... , column_name datatype)
```

In [8]:
query ="""
create table student
(roll_no int not null, name varchar(50), address varchar(100) )
"""

In [9]:
# cursor is used to execute sql query
cur = con.cursor()

In [10]:
cur.execute(query)

In [11]:
try: 
    cur.execute(query)
except Exception as e:
    print(e)

table student already exists

# Insert stetement in sql

```sql
Insert into table_name (column_name_1, column_name_2,... ,column_name_n)
Values
(value_1, value_2, ... , value_n)
```

In [12]:
query ='''
Insert into student (roll_no,name,address)
values
(1, 'kshitiz', 'lalitpur'),
(2, 'Abhishek', 'Bhaktapur'),
(3, 'Susan', 'Kathmandu'),
(4, 'Bikash', 'Banepa')
'''

In [13]:
cur.execute(query)

# Read data in sql using select statement

```sql
select * from table_name
```

'*' vaneko sabai column ho

In [14]:
query ='select * from student'

In [15]:
cur.execute(query)

In [16]:
cur.execute (query).fetchall() #db ma table read garda . fetchall() garne

[(1, 'kshitiz', 'lalitpur'),
 (2, 'Abhishek', 'Bhaktapur'),
 (3, 'Susan', 'Kathmandu'),
 (4, 'Bikash', 'Banepa')]

In [17]:
# select only name column
cur.execute("select name from student").fetchall()

[('kshitiz',), ('Abhishek',), ('Susan',), ('Bikash',)]

In [18]:
cur.execute("select roll_no from student").fetchall()

[(1,), (2,), (3,), (4,)]

In [19]:
cur.execute("select address from student").fetchall()

[('lalitpur',), ('Bhaktapur',), ('Kathmandu',), ('Banepa',)]

In [20]:
cur.execute("select roll_no,address from student").fetchall()

[(1, 'lalitpur'), (2, 'Bhaktapur'), (3, 'Kathmandu'), (4, 'Banepa')]

In [21]:
# find name of all student who lives in Bhakatapur

In [22]:
query="""
select name from student
where
address ='Bhaktapur'
"""

In [23]:
cur.execute(query).fetchall()

[('Abhishek',)]

In [24]:
# address of student where roll_No 4.

In [25]:
cur.execute("select address from student where roll_no = 4").fetchall()

[('Banepa',)]

In [31]:
cur.execute("select roll_no from student where name='kshitiz'").fetchall()

[(1,)]

In [32]:
cur.execute("select address from student where name='kshitiz'").fetchall()

[('lalitpur',)]

# Update statement in sql
```sql
update table_name
set value _n= new_value_n
where 
condition 
```

In [36]:
query = """
update student
set name = 'Kshitiz Regmi'
where
roll_no = 1
"""

In [37]:
cur.execute(query)

In [38]:
cur.execute("select * from student").fetchall()

[(1, 'Kshitiz Regmi', 'lalitpur'),
 (2, 'Abhishek', 'Bhaktapur'),
 (3, 'Susan', 'Kathmandu'),
 (4, 'Bikash', 'Banepa')]

In [39]:
query ="""
update student
set address ="patan"
where 
roll_no =1 
"""

In [41]:
cur.execute(query)

In [43]:
cur.execute("select * from student").fetchall()

[(1, 'Kshitiz Regmi', 'patan'),
 (2, 'Abhishek', 'Bhaktapur'),
 (3, 'Susan', 'Kathmandu'),
 (4, 'Bikash', 'Banepa')]

In [44]:
# roll_no 1 ko address patan banunu parkyo
cur.execute("update student set address ='patan' where roll_no = 1")

In [49]:
cur.execute("select * from student ").fetchall()

[(2, 'Abhishek', 'Bhaktapur'),
 (3, 'Susan', 'Kathmandu'),
 (4, 'Bikash', 'Banepa')]

# delet row in sql
```sql
delete from table_name
where 
condition
```

In [47]:
cur.execute("delete from student where roll_no = 1")

In [48]:
cur.execute("select *from student").fetchall()

[(2, 'Abhishek', 'Bhaktapur'),
 (3, 'Susan', 'Kathmandu'),
 (4, 'Bikash', 'Banepa')]